resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">

<div id="outline-container-org2f623a9" class="outline-2">
<h2 id="org2f623a9"><span class="section-number-2">1</span> Contact</h2>
<div class="outline-text-2" id="text-1">
<hr />
<table border="1" cellspacing="0" cellpadding="6" rules="none" frame="void" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">QQ</td>
<td class="org-left">344300476</td>
</tr>

<tr>
<td class="org-left">Mobile</td>
<td class="org-left">(+86)153-3879-6096</td>
</tr>

<tr>
<td class="org-left">Email</td>
<td class="org-left">344300476@qq.com</td>
</tr>

<tr>
<td class="org-left">GitHub</td>
<td class="org-left"><a href="https://github.com/phenix3443">https://github.com/phenix3443</a></td>
</tr>

<tr>
<td class="org-left">Blog</td>
<td class="org-left"><a href="https://phenix3443.github.io/notebook">https://phenix3443.github.io/notebook</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbb0b0ab" class="outline-2">
<h2 id="orgbb0b0ab"><span class="section-number-2">2</span> Education</h2>
<div class="outline-text-2" id="text-2">
<hr />

<table border="1" cellspacing="0" cellpadding="6" rules="none" frame="void" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">2010.9 ~ 2013.1</td>
<td class="org-left">University of Science and Technology of China (USTC)</td>
<td class="org-left">Software Engineering Information Security (Master of Science)</td>
</tr>

<tr>
<td class="org-left">2005.9 ~ 2009.7</td>
<td class="org-left">Harbin Institute of Technology (HIT)</td>
<td class="org-left">Computer Information Security (Bachelor of Science)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd0fe6f0" class="outline-2">
<h2 id="orgd0fe6f0"><span class="section-number-2">3</span> Opensource</h2>
<div class="outline-text-2" id="text-3">
<hr />
<ul class="org-ul">
<li><a href="https://github.com/phenix3443/openresty-delvelop-frame">openresty-delvelop-frame</a> a development framework based on OpenResty.</li>
<li><a href="https://github.com/phenix3443/lsp-lua-emmy">lsp-lua-emmy</a> Emacs's lua LanguageServer client.</li>
<li><a href="https://github.com/go-eden/slf4go-zap">slf4go-zap</a> slf4go's zap adapter.</li>
<li><a href="https://github.com/phenix3443/golog">golog</a> a golang log package integrated with zap.</li>
</ul>
</div>
</div>

<div id="outline-container-org0020a4d" class="outline-2">
<h2 id="org0020a4d"><span class="section-number-2">4</span> Skills</h2>
<div class="outline-text-2" id="text-4">
<hr />
<ul class="org-ul">
<li>Proficient in C/C++, Golang, Python, Lua languages, and testing frameworks such as cmockery, gtest, gocheck, unitest, luaunit, etc.</li>
<li>Proficient in Openresty, beego, gin, etc., and able to locate problems using flame maps.</li>
<li>Proficient in using pressure measurement tools such as AB, WRK, VEGETA, mastering traffic replication tools and techniques such as TCPCopy, NGINX mirror, goreplay, etc.</li>
<li>Familiar with MySQL database and Redis.</li>
<li>Experience with high concurrency service architecture and development.</li>
</ul>
</div>
</div>

<div id="outline-container-org30def9d" class="outline-2">
<h2 id="org30def9d"><span class="section-number-2">5</span> Employment</h2>
<div class="outline-text-2" id="text-5">
<hr />

<ul class="org-ul">
<li>Xunlei Limited (2015.12 ~ Now)
<ul class="org-ul">
<li>Novel Project
<ul class="org-ul">
<li>Technologies: Golang, MySQL, Redis</li>
<li>Tasks: maintain the novel services.</li>
<li>Contributions:
<ul class="org-ul">
<li>Critical interface response is decreased to 50 ms from 1-2s .</li>
<li>Reduce cache usage from a peak of around 13GB to 1GB.</li>
</ul></li>
</ul></li>

<li>OneCloud Project
<ul class="org-ul">
<li>Technologies: C, C++, Openresty, MySQL, Redis.</li>
<li>Tasks: Responsible for several important systems in the backend of Hakka Cloud, with a small amount of involvement in firmware development in the later stages.</li>
<li>contributions:
<ul class="org-ul">
<li>Guarantee the normal operation of OneCloud.</li>
<li>Reorganize and optimize server-side related code to promote automated testing, monitoring and other functions.</li>
</ul></li>
</ul></li>

<li>High-speed &amp; Offline Download Project
<ul class="org-ul">
<li>Technologies: C++, Lua, Python, Golang, Openresty, MySQL, Redis, Docker, Scrapy, OpenFalcon.</li>
<li>Tasks: Responsible for the development and maintenance of multiple critical system services.</li>
<li>Contributions: Promoting project engineering, automation and optimizing acceleration.
<ul class="org-ul">
<li>Engineering.
<ul class="org-ul">
<li>Undertake extensive code refactoring to summarize and refine a code framework that fits their business: <a href="https://github.com/phenix3443/openresty-delvelop-frame">openresty-delvelop-frame</a>.</li>
<li>Use OpenFalcon to monitor all service operations, dock office software nailing, and identify and address online issues in a timely manner.</li>
<li>Write and promote public repositories and services to streamline development processes and increase development efficiency.</li>
</ul></li>

<li>automation
<ul class="org-ul">
<li>Develop a protocol parser from which to write test cases for the service's interfaces to ensure the smooth running of important nodes.</li>
<li>Develop automated login and deployment tools for development and operations personnel based on PEXPECT.</li>
<li>Automated testing using testing frameworks (GTest, GMock, LuaUnit, Gocheck, etc.), docker and other technologies.</li>
<li>Introduce technologies such as tcpcopy, nignx mirror, etc. for service stress testing and traffic testing.</li>
</ul></li>

<li>Optimized acceleration effect
<ul class="org-ul">
<li>Use crawlers to pre-gather popular online resources and deploy them in advance to improve acceleration.</li>
<li>Optimize acceleration node allocation algorithm to improve the success rate and integrity of Xunlei acceleration.</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>

<li>Shenzhen Shangyou Games Co., Ltd. (2014 ~ 2015)
<ul class="org-ul">
<li>Tasks: Game server development.</li>
<li>Technologies: C++, Lua</li>
</ul></li>

<li>TP-Link Technologies Co., Ltd (2013 ~ 2014)
<ul class="org-ul">
<li>Tasks: Router development.</li>
<li>Technologies: C</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
